aws-samples/aws-stm32-ml-at-edge-accelerator/stm32/Middleware/ARM/trusted-firmware-m/platform/ext/target/nordic_nrf/common/core/nrfx/hal/nrf_qspi.h
/*
 * Copyright (c) 2016 - 2020, Nordic Semiconductor ASA
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 *    list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * 3. Neither the name of the copyright holder nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
 * SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
 * CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
 * ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 */

#ifndef NRF_QSPI_H__
#define NRF_QSPI_H__

#include <nrfx.h>
#include <nrf_erratas.h>

#ifdef __cplusplus
extern "C" {
#endif

/**
 * @defgroup nrf_qspi_hal QSPI HAL
 * @{
 * @ingroup nrf_qspi
 * @brief   Hardware access layer for managing the QSPI peripheral.
 */

#if defined(QSPI_XIPEN_XIPEN_Msk) || defined(__NRFX_DOXYGEN__)
/** @brief Symbol indicating whether XIP can be explicitly enabled or disabled via XIPEN register. */
#define NRF_QSPI_HAS_XIPEN 1
#else
#define NRF_QSPI_HAS_XIPEN 0
#endif

#if defined(QSPI_XIP_ENC_ENABLE_ENABLE_Msk) || defined(__NRFX_DOXYGEN__)
/** @brief Symbol indicating whether encryption for XIP is present. */
#define NRF_QSPI_HAS_XIP_ENC 1
#else
#define NRF_QSPI_HAS_XIP_ENC 0
#endif

#if defined(QSPI_DMA_ENC_ENABLE_ENABLE_Msk) || defined(__NRFX_DOXYGEN__)
/** @brief Symbol indicating whether encryption for EasyDMA is present. */
#define NRF_QSPI_HAS_DMA_ENC 1
#else
#define NRF_QSPI_HAS_DMA_ENC 0
#endif

#if defined(QSPI_IFCONFIG1_SPIMODE_MODE3) || defined(__NRFX_DOXYGEN__)
/** @brief Symbol indicating whether support for QSPI mode 1 is present. */
#define NRF_QSPI_HAS_MODE_1 1
#else
#define NRF_QSPI_HAS_MODE_1 0
#endif

#if defined(NRF53_SERIES) || defined(__NRFX_DOXYGEN__)
/** @brief Value representing QSPI base clock frequency. */
#define NRF_QSPI_BASE_CLOCK_FREQ 96000000uL
#else
#define NRF_QSPI_BASE_CLOCK_FREQ 32000000uL
#endif

/**
 * @brief This value can be used as a parameter for the @ref nrf_qspi_pins_set
 *        function to specify that a given QSPI signal (SCK, CSN, IO0, IO1, IO2, or IO3)
 *        will not be connected to a physical pin.
 */
#define NRF_QSPI_PIN_NOT_CONNECTED 0xFF

/** @brief Macro for setting proper values to pin registers. */
#define NRF_QSPI_PIN_VAL(pin) (pin) == NRF_QSPI_PIN_NOT_CONNECTED ? 0xFFFFFFFF : (pin)


/** @brief QSPI tasks. */
typedef enum
{
    NRF_QSPI_TASK_ACTIVATE   = offsetof(NRF_QSPI_Type, TASKS_ACTIVATE),   /**< Activate the QSPI interface. */
    NRF_QSPI_TASK_READSTART  = offsetof(NRF_QSPI_Type, TASKS_READSTART),  /**< Start transfer from external flash memory to internal RAM. */
    NRF_QSPI_TASK_WRITESTART = offsetof(NRF_QSPI_Type, TASKS_WRITESTART), /**< Start transfer from internal RAM to external flash memory. */
    NRF_QSPI_TASK_ERASESTART = offsetof(NRF_QSPI_Type, TASKS_ERASESTART), /**< Start external flash memory erase operation. */
    NRF_QSPI_TASK_DEACTIVATE = offsetof(NRF_QSPI_Type, TASKS_DEACTIVATE), /**< Deactivate the QSPI interface. */
} nrf_qspi_task_t;

/** @brief QSPI events. */
typedef enum
{
    NRF_QSPI_EVENT_READY = offsetof(NRF_QSPI_Type, EVENTS_READY) /**< QSPI peripheral is ready after it executes any task. */
} nrf_qspi_event_t;

/** @brief QSPI interrupts. */
typedef enum
{
    NRF_QSPI_INT_READY_MASK = QSPI_INTENSET_READY_Msk /**< Interrupt on READY event. */
} nrf_qspi_int_mask_t;

/** @brief QSPI base clock frequency divider values. */
typedef enum
{
    NRF_QSPI_FREQ_DIV1,  /**< Divide by 1. */
    NRF_QSPI_FREQ_DIV2,  /**< Divide by 2. */
    NRF_QSPI_FREQ_DIV3,  /**< Divide by 3. */
    NRF_QSPI_FREQ_DIV4,  /**< Divide by 4. */
    NRF_QSPI_FREQ_DIV5,  /**< Divide by 5. */
    NRF_QSPI_FREQ_DIV6,  /**< Divide by 6. */
    NRF_QSPI_FREQ_DIV7,  /**< Divide by 7. */
    NRF_QSPI_FREQ_DIV8,  /**< Divide by 8. */
    NRF_QSPI_FREQ_DIV9,  /**< Divide by 9. */
    NRF_QSPI_FREQ_DIV10, /**< Divide by 10. */
    NRF_QSPI_FREQ_DIV11, /**< Divide by 11. */
    NRF_QSPI_FREQ_DIV12, /**< Divide by 12. */
    NRF_QSPI_FREQ_DIV13, /**< Divide by 13. */
    NRF_QSPI_FREQ_DIV14, /**< Divide by 14. */
    NRF_QSPI_FREQ_DIV15, /**< Divide by 15. */
    NRF_QSPI_FREQ_DIV16, /**< Divide by 16. */
} nrf_qspi_frequency_t;

#if defined(NRF52_SERIES)
/** Symbols translation for backward compatibility. */
#define NRF_QSPI_FREQ_32MDIV1  NRF_QSPI_FREQ_DIV1
#define NRF_QSPI_FREQ_32MDIV2  NRF_QSPI_FREQ_DIV2
#define NRF_QSPI_FREQ_32MDIV3  NRF_QSPI_FREQ_DIV3
#define NRF_QSPI_FREQ_32MDIV4  NRF_QSPI_FREQ_DIV4
#define NRF_QSPI_FREQ_32MDIV5  NRF_QSPI_FREQ_DIV5
#define NRF_QSPI_FREQ_32MDIV6  NRF_QSPI_FREQ_DIV6
#define NRF_QSPI_FREQ_32MDIV7  NRF_QSPI_FREQ_DIV7
#define NRF_QSPI_FREQ_32MDIV8  NRF_QSPI_FREQ_DIV8
#define NRF_QSPI_FREQ_32MDIV9  NRF_QSPI_FREQ_DIV9
#define NRF_QSPI_FREQ_32MDIV10 NRF_QSPI_FREQ_DIV10
#define NRF_QSPI_FREQ_32MDIV11 NRF_QSPI_FREQ_DIV11
#define NRF_QSPI_FREQ_32MDIV12 NRF_QSPI_FREQ_DIV12
#define NRF_QSPI_FREQ_32MDIV13 NRF_QSPI_FREQ_DIV13
#define NRF_QSPI_FREQ_32MDIV14 NRF_QSPI_FREQ_DIV14
#define NRF_QSPI_FREQ_32MDIV15 NRF_QSPI_FREQ_DIV15
#define NRF_QSPI_FREQ_32MDIV16 NRF_QSPI_FREQ_DIV16
#endif

